### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_policy_fragment.auth will be updated in-place
  ~ resource "azurerm_api_management_policy_fragment" "auth" {
        id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/policyFragments/io-com-app-session-fragment"
        name              = "io-com-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          - 	<!-- Extract the token from the Authorization Header -->
          - 	<set-variable name="token" value="@{     string[] values;     return context.Request.Headers.TryGetValue(&quot;Authorization&quot;, out values) ? values.FirstOrDefault() : &quot;&quot;;   }" />
          - 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 	<choose>
          - 		<when condition="@(       string.IsNullOrEmpty((string)context.Variables[&quot;token&quot;]) ||       !(((string)context.Variables[&quot;token&quot;]).StartsWith(&quot;Bearer &quot;, StringComparison.OrdinalIgnoreCase)) ||       string.IsNullOrWhiteSpace(((string)context.Variables[&quot;token&quot;]).Substring(7))     )">
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response>
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 	</choose>
          - 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 		<set-method>GET</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          - 		</set-header>
          - 		<set-header name="Authorization" exists-action="override">
          - 			<value>@(((string)context.Variables["token"]))</value>
          - 		</set-header>
          - 	</send-request>
          - 	<choose>
          - 		<!-- If 200 return set the x-user header as the base64 of the response -->
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 200)">
          - 			<!-- Parse the introspectionResponse as a string -->
          - 			<set-variable name="userData" value="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).Body.As&lt;string&gt;())" />
          - 			<!-- Remove the Authorization Header -->
          - 			<set-header name="Authorization" exists-action="delete" />
          - 			<!-- Set the x-user header with the user data -->
          - 			<set-header name="x-user" exists-action="override">
          - 				<value>@(
          -           Convert.ToBase64String(
          -               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          -           )
          -         )</value>
          - 			</set-header>
          - 		</when>
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 401)">
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 		<otherwise>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="500" reason="Internal Server Error" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</otherwise>
          - 	</choose>
          + <fragment>
          + 	<!-- Extract the token from the Authorization Header -->
          +   <set-variable name="token" value='@{
          +     string[] values;
          +     return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
          +   }' />
          + 
          +   <!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          +   <choose>
          +     <when condition='@(
          +       string.IsNullOrEmpty((string)context.Variables["token"]) ||
          +       !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
          +       string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
          +     )'>
          +       <set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          +       </set-header>
          +       <return-response>
          +         <set-status code="401" reason="Unauthorized" />
          +         <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +       </return-response>
          +   </when>
          +   </choose>
          + 
          +   <!-- Call the session manager, pasing the bearer token, to get the user identity -->
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-method>GET</set-method>
          + 		<set-header name="Content-Type" exists-action="override">
          +       <value>application/json</value>
          + 		</set-header>
          + 		<set-header name="Authorization" exists-action="override">
          +       <value>@(((string)context.Variables["token"]))</value>
          + 		</set-header>
          + 	</send-request>
          + 
          + 	<choose>
          +     <!-- If 200 return set the x-user header as the base64 of the response -->
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)'>
          + 			<!-- Parse the introspectionResponse as a string -->
          + 			<set-variable name="userData" value='@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())' />
          + 			<!-- Remove the Authorization Header -->
          + 			<set-header name="Authorization" exists-action="delete" />
          + 			<!-- Set the x-user header with the user data -->
          + 			<set-header name="x-user" exists-action="override">
          + 				<value>@(
          +           Convert.ToBase64String(
          +               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          +           )
          +         )</value>
          + 			</set-header>
          + 		</when>
          + 
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)'>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="401" reason="Unauthorized" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 			</return-response>
          + 		</when>
          + 
          + 		<otherwise>
          + 			<set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          + 			</set-header>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="500" reason="Internal Server Error" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +         </return-response>
          + 		</otherwise>
          + 	</choose>
            </fragment>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.notification_hubs_itn.azurerm_monitor_metric_alert.alert_nh_partitions_anomalous_pns_success_volume will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_partitions_anomalous_pns_success_volume" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partitions have an anomalous PNS success volume. Runbook: not needed."
      + enabled                  = false
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH] Push Notification Service anomalous success volume"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "outgoing.allpns.success"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # module.notification_hubs_itn.azurerm_monitor_metric_alert.alert_nh_partitions_pns_errors will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_partitions_pns_errors" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partitions incurred in PNS errors, please check. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[IOCOM][NH]Push Notification Service errors"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "Medium"
          + evaluation_failure_count = 4
          + evaluation_total_count   = 4
          + metric_name              = "outgoing.allpns.pnserror"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_1 will be created
  + resource "azurerm_notification_hub" "partition_1" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-01"
      + namespace_name      = "io-p-itn-com-nhns-01"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_2 will be created
  + resource "azurerm_notification_hub" "partition_2" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-02"
      + namespace_name      = "io-p-itn-com-nhns-02"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_3 will be created
  + resource "azurerm_notification_hub" "partition_3" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-03"
      + namespace_name      = "io-p-itn-com-nhns-03"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_4 will be created
  + resource "azurerm_notification_hub" "partition_4" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-04"
      + namespace_name      = "io-p-itn-com-nhns-04"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.sandbox will be created
  + resource "azurerm_notification_hub" "sandbox" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-sandbox"
      + namespace_name      = "io-p-itn-com-nhns-sandbox"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_1_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_1_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-01"
      + notification_hub_name       = "io-p-itn-com-nh-01"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_1_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_1_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-01"
      + notification_hub_name       = "io-p-itn-com-nh-01"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_2_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_2_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-02"
      + notification_hub_name       = "io-p-itn-com-nh-02"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_2_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_2_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-02"
      + notification_hub_name       = "io-p-itn-com-nh-02"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_3_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_3_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-03"
      + notification_hub_name       = "io-p-itn-com-nh-03"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_3_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_3_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-03"
      + notification_hub_name       = "io-p-itn-com-nh-03"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_4_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_4_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-04"
      + notification_hub_name       = "io-p-itn-com-nh-04"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_4_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_4_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-04"
      + notification_hub_name       = "io-p-itn-com-nh-04"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.sandbox_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "sandbox_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-sandbox"
      + notification_hub_name       = "io-p-itn-com-nh-sandbox"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.sandbox_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "sandbox_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-sandbox"
      + notification_hub_name       = "io-p-itn-com-nh-sandbox"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

Plan: 17 to add, 1 to change, 0 to destroy.
```

</details>
